-- 01. Напишете заявка, която извежда модел, честота и размер на диска за всички персонални компютри с цена под 1200 долара. Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB.
SELECT model, speed AS 'MHz', hd AS 'GB' FROM pc WHERE price < 1200;

-- 02. Напишете заявка, която извежда производителите на принтери без повторения.
SELECT DISTINCT maker FROM product;

-- 03. Напишете заявка, която извежда модел, размер на паметта, размер на екран за лаптопите, чиято цена е над 1000 долара.
SELECT model, hd, screen FROM laptop WHERE price > 1000;

-- 04. Напишете заявка, която извежда всички цветни принтери.
SELECT * FROM printer WHERE color = 'y';

-- 05. Напишете заявка, която извежда модел, честота и размер на диска за тези персонални компютри със CD 12x или 16x и цена под 2000 долара.
SELECT * FROM pc WHERE price < 2000 AND (cd = '12x' OR cd = '16px');
